In [10]:
#imports 
import pandas as pd
import matplotlib.pyplot as plt

In [11]:
#load in dataset 
#load the dataset
data_url = "https://raw.githubusercontent.com/suber-mhci/tutorials/master/MoviesOnStreamingPlatforms_updated.csv"
df = pd.read_csv(data_url)
df.head()

   Unnamed: 0  ID  ...                              Language  Runtime
0           0   1  ...  English,Italian,Latin,Spanish,German    209.0
1           1   2  ...                         Hindi,English    161.0
2           2   3  ...                               English     83.0
3           3   4  ...                         Hindi,English    224.0
4           4   5  ...                               English     52.0

[5 rows x 17 columns]

In [12]:
df_sample = df.drop(['Unnamed: 0', 'ID'], axis=1) 
df_year = df["Year"]
df_sample.columns

Index(['Title', 'Year', 'Age', 'IMDb', 'Rotten Tomatoes', 'Netflix', 'Hulu',
       'Prime Video', 'Disney+', 'Type', 'Directors', 'Genres', 'Country',
       'Language', 'Runtime'],
      dtype='object')

In [13]:
#dataset seperated by streaming service 
df_netflix = df_sample[df_sample["Netflix"] == 1]
df_hulu = df_sample[df_sample["Hulu"] == 1]
df_amazon = df_sample[df_sample["Prime Video"] == 1]
df_disney = df_sample[df_sample["Disney+"] == 1]

In [14]:
#new dataframes 
df_imdb = pd.DataFrame()
df_rt = pd.DataFrame()
df_age = pd.DataFrame()
df_run = pd.DataFrame()

In [15]:
#seperate streaming services for IMDB
df_imdb["Netflix"] = df_netflix['IMDb'].str[:-3]
df_imdb["Amazon Prime"] = df_amazon['IMDb'].str[:-3]
df_imdb["Disney+"] = df_disney['IMDb'].str[:-3]
df_imdb["Hulu"] = df_hulu['IMDb'].str[:-3]
df_imdb.head()

  Netflix Amazon Prime Disney+ Hulu
0     7.8          NaN     NaN  NaN
1     8.4          NaN     NaN  NaN
2     9.0          NaN     NaN  NaN
3     8.1          NaN     NaN  NaN
4     7.7          NaN     NaN  NaN

In [16]:
#seperate streaming services for Rotten Tomatoes 
df_rt["Netflix"] = df_netflix['Rotten Tomatoes'].str[:-4]
df_rt["Amazon Prime"] = df_amazon['Rotten Tomatoes'].str[:-4]
df_rt["Disney+"] = df_disney['Rotten Tomatoes'].str[:-4]
df_rt["Hulu"] = df_hulu['Rotten Tomatoes'].str[:-4] 
df_rt.head()

  Netflix Amazon Prime Disney+ Hulu
0      98          NaN     NaN  NaN
1      97          NaN     NaN  NaN
2      95          NaN     NaN  NaN
3      94          NaN     NaN  NaN
4      94          NaN     NaN  NaN

In [17]:
#seperate streaming services for Target Ages  
df_age["Netflix"] = df_netflix['Age'].str[:-1]
df_age["Amazon Prime"] = df_amazon['Age'].str[:-1]
df_age["Disney+"] = df_disney['Age'].str[:-1]
df_age["Hulu"] = df_hulu['Age'].str[:-1] 
df_age.head()

  Netflix Amazon Prime Disney+ Hulu
0      18          NaN     NaN  NaN
1       7          NaN     NaN  NaN
2       7          NaN     NaN  NaN
3       7          NaN     NaN  NaN
4      18          NaN     NaN  NaN

In [18]:
#seperate streaming services for runtime
#seperate streaming services for Target Ages  
df_run["Netflix"] = df_netflix['Runtime']
df_run["Amazon Prime"] = df_amazon['Runtime']
df_run["Disney+"] = df_disney['Runtime']
df_run["Hulu"] = df_hulu['Runtime']
df_run.head()

   Netflix  Amazon Prime  Disney+  Hulu
0    209.0           NaN      NaN   NaN
1    161.0           NaN      NaN   NaN
2     83.0           NaN      NaN   NaN
3    224.0           NaN      NaN   NaN
4     52.0           NaN      NaN   NaN

In [19]:
#add the years column to the dataframes
df_imdb.insert(loc=0, column='Year', value=df_year)
df_rt.insert(loc=0, column='Year', value=df_year)
df_age.insert(loc=0, column='Year', value=df_year)
df_run.insert(loc=0, column='Year', value=df_year)

In [20]:
#save csv 
from google.colab import drive
drive.mount('drive')

Mounted at drive

In [21]:
df_imdb.to_csv('imdb_data.csv', index=False)
!cp imdb_data.csv "drive/My Drive/"

df_rt.to_csv('rt_data.csv', index=False)
!cp rt_data.csv "drive/My Drive/"

df_age.to_csv('age_data.csv', index=False)
!cp age_data.csv "drive/My Drive/"

df_run.to_csv('runtime_data.csv', index=False)
!cp runtime_data.csv "drive/My Drive/"